# Exercise 1

# Steps to follow with any dataset
1. Import pandas and we usually give it the name pd
2. Read your dataset and save it into a variable which we ususally name df

In [1]:
import pandas as pd 
df=pd.read_csv('../data/cafe_sales.csv') #df has our dataset now let's print it to see how it looks like

df

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11
...,...,...,...,...,...,...,...,...
9995,TXN_7672686,Coffee,2,2.0,4.0,NaN,UNKNOWN,2023-08-30
9996,TXN_9659401,NaN,3,NaN,3.0,Digital Wallet,NaN,2023-06-02
9997,TXN_5255387,Coffee,4,2.0,8.0,Digital Wallet,NaN,2023-03-02
9998,TXN_7695629,Cookie,3,NaN,3.0,Digital Wallet,NaN,2023-12-02
9999,TXN_6170729,Sandwich,3,4.0,12.0,Cash,In-store,2023-11-07

Right Away we noted some NaN value which means "Not a Number" and that tells us that specific cell is empty
To get more details about our dataset we use describe() and info()

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB

In [5]:
df.describe()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,10000,9667,9862,9821,9827,7421,6735,9841
unique,10000,10,7,8,19,5,4,367
top,TXN_1961373,Juice,5,3.0,6.0,Digital Wallet,Takeaway,UNKNOWN
freq,1,1171,2013,2429,979,2291,3022,159

### Conclusions:
1. Transaction ID has no Null or NaN or Empty Values
2. Item, Quantity, Price Per Unite, Total Spent, Payment Method,Location, and Transaction Date all have Null Values
3. All the columns are of the type object which we need to fix
Let's see how we are going to deal with each one of these

#### First let's deal with the empty values in the Item Column, Since we have a Price Per Unite we can deduce what item that was

In [7]:
df.Item.unique()

array(['Coffee', 'Cake', 'Cookie', 'Salad', 'Smoothie', 'UNKNOWN',
       'Sandwich', nan, 'ERROR', 'Juice', 'Tea'], dtype=object)

In [9]:
#let's make a price dict
item_price = {
    'Coffee': 2.0,
    'Tea': 1.5,
    'Sandwich': 4.0,
    'Salad': 3.0,
    'Cake': 3.0,
    'Cookie': 1.0,
    'Smoothie': 4.0,
    'Juice': 3.0
}

# Reverse mapping (price to item)
price_item = {price: item for item, price in item_price.items()}

# Fill missing 'Item' values based on 'Price Per Unit'
df['Item'] = df['Item'].fillna(df['Price Per Unit'].map(price_item))

df

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11
...,...,...,...,...,...,...,...,...
9995,TXN_7672686,Coffee,2,2.0,4.0,NaN,UNKNOWN,2023-08-30
9996,TXN_9659401,NaN,3,NaN,3.0,Digital Wallet,NaN,2023-06-02
9997,TXN_5255387,Coffee,4,2.0,8.0,Digital Wallet,NaN,2023-03-02
9998,TXN_7695629,Cookie,3,NaN,3.0,Digital Wallet,NaN,2023-12-02
9999,TXN_6170729,Sandwich,3,4.0,12.0,Cash,In-store,2023-11-07

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB

### Looking at the data nothing changed now think about why before seeing it

  The Data type in column Price Per Unit is Object and that needs to converted to float!

In [11]:
try:
    df['Price Per Unit']=df['Price Per Unit'].astype(float)
except Exception as e:
    print(e)
    pass

could not convert string to float: 'ERROR'

### So... we spot the error

    There is a value in column 'Price Per Unit' that is a string 'ERROR' so let's fix that 
    1. We are going to use numpy and import it as np to get the NaN value from it
    2. We are going to replace the word ERROR and UNKNOWN with np.nan

In [13]:
import numpy as np

df['Price Per Unit'] = df['Price Per Unit'].replace(['ERROR', 'UNKNOWN'], np.nan)
df['Price Per Unit']=df['Price Per Unit'].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9467 non-null   float64
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(1), object(7)
memory usage: 625.1+ KB

### Now we can see the data type for the column Price Per Unit to be float!

In [15]:
df['Item'] = df['Item'].fillna(df['Price Per Unit'].map(price_item))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9939 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9467 non-null   float64
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(1), object(7)
memory usage: 625.1+ KB

### After filling it up it seems we have around 61 missing values and that's because the column 'Price Per Unit' has value NaN as well as 'Item' column
What would you do in this case?

    Since we now can't find the Item Sold we are going to try two different methods:
    1. We are going to determine the 'Price Per Unit' by deviding the 'Total Spent' by 'Quantity' 
    2. Drop all the null values in the column Item
    But let's first convert them both to float!

#### Converting Total Spent

In [17]:
df['Total Spent'] = df['Total Spent'].replace(['ERROR', 'UNKNOWN'], np.nan)
df['Total Spent']=df['Total Spent'].astype(float)

#### Converting Quantity

In [20]:
df['Quantity'] = df['Quantity'].replace(['ERROR', 'UNKNOWN'], np.nan)
df['Quantity']=df['Quantity'].astype(float)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9939 non-null   object
 2   Quantity          9521 non-null   float64
 3   Price Per Unit    9467 non-null   float64
 4   Total Spent       9498 non-null   float64
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(3), object(5)
memory usage: 625.1+ KB

#### Filling the null value in column Price Per Unit

In [24]:
df['Price Per Unit'] = df['Price Per Unit'].fillna(df['Total Spent']/df['Quantity'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9939 non-null   object
 2   Quantity          9521 non-null   float64
 3   Price Per Unit    9962 non-null   float64
 4   Total Spent       9498 non-null   float64
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(3), object(5)
memory usage: 625.1+ KB

### Now let's retry to fill Item Column

In [26]:
df['Item'] = df['Item'].fillna(df['Price Per Unit'].map(price_item))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9960 non-null   object
 2   Quantity          9521 non-null   float64
 3   Price Per Unit    9962 non-null   float64
 4   Total Spent       9498 non-null   float64
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: float64(3), object(5)
memory usage: 625.1+ KB

### We still have missing items and since we can't possible determine what are these items we are going to drop them

In [28]:
df.dropna(subset=['Item'], inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9960 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9960 non-null   object
 1   Item              9960 non-null   object
 2   Quantity          9484 non-null   float64
 3   Price Per Unit    9924 non-null   float64
 4   Total Spent       9460 non-null   float64
 5   Payment Method    7391 non-null   object
 6   Location          6712 non-null   object
 7   Transaction Date  9801 non-null   object
dtypes: float64(3), object(5)
memory usage: 700.3+ KB

### Moving on to the column 'Transaction Date' it's a vital column and we need it and since we can't possibly get the date we are going to drop any null values

In [30]:
df.dropna(subset=['Transaction Date'], inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9801 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9801 non-null   object
 1   Item              9801 non-null   object
 2   Quantity          9334 non-null   float64
 3   Price Per Unit    9767 non-null   float64
 4   Total Spent       9310 non-null   float64
 5   Payment Method    7280 non-null   object
 6   Location          6607 non-null   object
 7   Transaction Date  9801 non-null   object
dtypes: float64(3), object(5)
memory usage: 689.1+ KB

In [37]:
### Checking for Unique values in Item column...

df.Item.unique()

array(['Coffee', 'Cake', 'Cookie', 'Salad', 'Smoothie', 'UNKNOWN',
       'Sandwich', 'Juice', 'ERROR', 'Tea'], dtype=object)

### Some of the items were signed as UNKNOWN and ERROR...

In [32]:
### For items that are UNKNOWN and ERROR - replace with nan values
df['Item'] = df['Item'].replace(['ERROR', 'UNKNOWN'], np.nan)

In [34]:
### Drop NAs 

df.dropna(subset=['Item'], inplace=True)


df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9175 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    9175 non-null   object
 1   Item              9175 non-null   object
 2   Quantity          8749 non-null   float64
 3   Price Per Unit    9145 non-null   float64
 4   Total Spent       8723 non-null   float64
 5   Payment Method    6819 non-null   object
 6   Location          6192 non-null   object
 7   Transaction Date  9175 non-null   object
dtypes: float64(3), object(5)
memory usage: 645.1+ KB

## Assertions

In [36]:
# 1. Compute the “expected” total for each row
expected = df["Quantity"] * df["Price Per Unit"]

# 2. Compare to the recorded total; find the difference
diff = expected - df["Total Spent"]

# 3. Take absolute value, since we only care about magnitude
abs_diff = diff.abs()

# 4. Check that each difference is smaller than 1e-6 (one-million's)
ok = abs_diff < 1e-6

# 5. Ensure *all* rows satisfy that condition
assert ok.all(), "Some rows have mismatched totals"

AssertionError: Some rows have mismatched totals

# Now we only have these columns with null values:
1. Quantity
2. Total Spent
3. Payment Method
4. Location

# Exercise 1: Fill out Columns

1) For "Total Spent" column: Multiply "Quantity" by "Price Per Unit". For "Quantity", divide the "Total Spent" by "Price per Unit".

df['Total Spent'] = df['Total Spent'].fillna(df['Quantity'] * df['Price Per Unit'])


1) Confirm with an assertion above that "Quantity * `Price Per Unit` - `Total Spent`"!
2) For "Payment method" and "Location", drop all not valid values (Unknown, Error). 
3) For Quantity, make sure all values are quantitative (float).

In [ ]:
df['Payment Method'] = df['Payment Method'].replace(['ERROR', 'UNKNOWN'], np.nan)
df['Location'] = df['Location'].replace(['ERROR', 'UNKNOWN'], np.nan)

In [47]:
df['Total Spent'] = df['Total Spent'].fillna(df['Quantity'] * df['Price Per Unit'])

In [53]:
df['Quantity'] = df['Quantity'].fillna(df['Total Spent'] / df['Price Per Unit'])

# Exercise 2: Remap Item Prices & Recalculate Total Spent
Goal: Suppose menu prices changed. Given a dict of “new” prices - multiplied by 2, update your DataFrame and recompute total spent.

# Exercise 3: Pivot Table by Location & Payment Method
Goal: Cross-tabulate sales to see regional/payment splits.

In [ ]:
#Hint: pivot = pd.pivot_table(
#    ...
#    ...
#    ...,
#    aggfunc='sum',
#    ...
#)

# Exercise 4: Rename Columns Using a Dictionary
Goal: Bring all column names into snake_case in one go. Use a dictionary.